{
  "\"LNG Price Surge Pushing Buyers To Look At Long-Term Contracts\": Petronet": "Petronet says long-term LNG is currently costing it $11-$12/million British thermal units compared to spot prices of around $40/mmBtu.",
  "100 crore vaccination doses claim 'false': Sanjay Raut": "Addressing a party meeting at Nashik in Maharashtra on Saturday, Raut said he would give proof that the 100 crore vaccination claim was \"false\".",
  "20 ITBP troops given gallantry medals for standoff clashes with China in Ladakh": "These medals were announced on the eve of Independence Day on August 14 this year. The central paramilitary is deployed shoulder-to-shoulder with the Army as part of its primary mandate to guard the 3,488 km-long icy Line of Actual Control (LAC).",
  "27 % OBC reservation in all India quota can't be subject matter of litigation again: DMK to SC": "The ruling party in Tamil Nadu told the top court that by the notification dated July 29, 2020 directing implementation of 27 per cent reservation for OBC (non-creamy layer) along with 10 per cent EWS reservation in 15 per cent UG and 50 per cent PG in all India quota seats-state contributed seats (SCS-AIQ).",
  "3 security personnel, captured Pak terrorist injured in Kashmir firing": "Three security personnel and an arrested Pakistani terrorist were injured on Sunday when militants opened fire",
  "438 infra projects show cost overrun of ₹4.3 lakh crore": "\n                The report also cited State-wise lockdowns due to COVID-19 as a reason for the delay in implementation of these projects.\n            ",
  "438 infrastructure projects show cost overrun of Rs 4.3 trillion": "As many as 438 infrastructure projects, each worth Rs 150 crore or more, have been hit by cost overruns",
  "7-yr-old girl raped in Delhi, DCW issues notice to police seeking action": "The incident took place on Friday when the victim was going to a place near her residence where food was being distributed for free, police said.",
  "Activist-poet Varavara Rao issued NBW by Sessions Court": "The case in which Rao has been made an accused is related to an attack by the Naxalites on a police team killing six of them and a civilian at Venkatammanahalli in Pavagada Taluk in Tumakuru district on February 10, 2005.",
  "Adobe to place unvaccinated employees on unpaid leave": "Adobe will consider religious and medical exemptions for employees who cannot take the COVID-19 vaccine.",
  "Ajinkya Rahane: I try to maintain a similar response to success as well as failures": "Ajinkya Rahane, vice-captain of the Indian Test cricket team, on his humble beginnings, how he deals with low phases in life, and a life beyond cricket.",
  "Akshay Kumar, Kartik Aaryan, John Abraham take on terrorists in films that could become top grossers in the genre": "Akshay Kumar is no stranger to the terrorism genre. Ditto for John Abraham, whose 'New York' and 'Batla House' are still among the top 10 Hindi films on terrorism, based on box-office collections.",
  "Amit Shah's J&K visit was necessary in aftermath of recent killings: Farooq Abdullah": "The former Jammu and Kashmir chief minister, however, questioned the claim of the BJP that militancy has been wiped out from the Union Territory.",
  "Apollo Tyres introduces Vredestein brand in India": "The home-grown tyre major is eyeing around 30 per cent market share in the segment over the next two years with the Vredestein range which would be locally produced from the company’s plants in Tamil Nadu and Andhra Pradesh.",
  "Apple updates App Store payment rules in concession to developers": "According to App Store rules updated Friday, developers can now contact consumers directly about alternative payment methods, bypassing Apple's commission of 15 or 30 percent.",
  "Are Bitcoin Prices And Inflation Related? Find Out": "Investors see in Bitcoin an opportunity to beat inflation and so put their money into it.",
  "Aromatherapy spray manufactured in India found to contain bacteria that sickened four people in the US: CDC": "The US Centers for Disease Control and Prevention (CDC) said laboratory testing has identified the bacteria Burkholderia pseudomallei in the aromatherapy spray Better Homes & Gardens Lavender & Chamomile Essential Oil Infused Aromatherapy Room Spray with Gemstones.'",
  "Aryan Khan case | NCB witness claims Rs 18 crore settlement: Report": "KP Gosavi is the alleged private investigator whose selfie with Aryan Khan went viral.",
  "Ashish Mishra, arrested for Lakhimpur violence, hospitalised with dengue": "Ashish Mishra, son of union minister Ajay Mishra Teni and the main accused in the Lakhimpur Kheri violence case, is reportedly suffering from dengue and has been hospitalised",
  "BJP govt has failed the country: Rahul Gandhi": "Taking to Twitter, Gandhi said the BJP government has been a failure and will continue to be so.",
  "BJP leaders dishonoured people's verdict, thrust bypoll on them by quitting as MLAs: Abhishek Banerjee": "Addressing a rally at Gosaba in South 24 Parganas, Banerjee pointed out that bypoll was necessitated here and in Khardah following the death of two TMC candidates, but the circumstance under which elections are being held in Shantipur and Dinhata are different.",
  "Best of India vs Pakistan: Top five T20I matches between arch-rivals": "As the familiar foes lock horns in their first game of the T20 World Cup 2021, here is a look at five epic T20 encounters of the past.",
  "BharatPe claims PhonePe ‘turned turtle’ in court on its stand against usage of ‘Pe’": "PhonePe in a statement on October 22 had said that it had approached the Bombay HC and withdrew the injunction later to address certain observations made by the Court. However, the company added that it will follow up by filing a fresh suit.",
  "Big new wave unlikely but too early to say India in endemic stage: Experts": "A disease is described as endemic when it continues to be present within a given geographical area but its impact is manageable",
  "Bollywood stars, Indian celebrities latch on to global craze for NFTs": "Bollywood superstars such as Amitabh Bachchan and Salman Khan are planning to launch NFTs soon. While Bachchan's NFTs will include autographed posters of his movies, Khan has been building excitement on his Twitter account by telling his 43 million followers about the planned NFT launch.",
  "CGST officials arrest firm operator for input tax credit fraud of nearly Rs 91 crore": "In a major drive initiated against fraudsters who are availing and utilising fake Input Tax Credit (ITC), the Thane Central GST Commissionerate, Mumbai CGST Zone, has arrested a mastermind who had opened a firm and was operating from Bhayandar west.",
  "CIDCO to provide water connection to buildings sans OCs in certain pockets of Navi Mumbai int'l airport rehab area": "Navi Mumbai International Airport (NMIA) is an under-construction greenfield international airport that will be the extension to the existing Chhatrapati Shivaji Maharaj International Airport in Mumbai.",
  "CISCE to conduct board exams in offline mode, announces revised date sheet": "The council also released a revised date sheet according to which the ICSE exams for class 10 will begin from November 29 and for class 12 (ISC) from November 12.",
  "CJI Ramana raises concern over judiciary infrastructure with Law Minister": "Noting that an effective judiciary can help in the growth of the economy, the CJI said courts are extremely essential for any society that is governed by rule of law.",
  "COVID-19: Centre asks states to ensure upcoming festivals celebrated with 'utmost precautions'": "In a letter to states and UTs, Union Health Secretary Rajesh Bhushan said standard operating procedures issued last month for curbing any spike in cases must be followed.",
  "Can Tesla survive without 'sleep-deprived' Elon Musk?": "Elon Musk has talked about stepping down from Tesla for a couple of years",
  "Centre asks states/UTs to increase coverage of second dose of COVID-19 vaccine": "The states/UTs were also urged to improve the momentum of vaccination and accelerate its coverage as the country moves forward to vaccinate all the eligible population by end of the year under the nationwide coronavirus vaccination drive.",
  "Changing your maiden name? Here is what you should do about your investments": "When they change the name, they should once and for all change everywhere by giving their marriage certificate so that this does not impact investments",
  "China Evergrande resumes work on more than 10 projects in different cities": "China Evergrande Group said on Sunday it had resumed work on the projects in Shenzhen, Dongguan and other cities",
  "China passes new land border law amid military standoff with India": "Members of the Standing Committee of the National People's Congress (NPC) approved the law at the closing meeting of a legislative session on Saturday, state-run Xinhua news agency reported.",
  "China successfully launches satellite to test space debris mitigation technology": "It was launched from the Xichang Satellite Launch Centre in southwest China's Sichuan Province.",
  "China's ambitions pose 'omnipresent danger' to South Asia's stability: CDS": "China is making \"huge\" inroads in South Asia: Gen Rawat",
  "Congress leaders to meet on October 26 to chalk out strategy for upcoming assembly polls": "The new membership drive of the party and finalising of the modalities for it would also be discussed during the meeting.",
  "Coronavirus Update | Active COVID-19 cases decline to 1,72,594": "Coronavirus Update | The death toll climbed to 4,54,269 with 561 fresh fatalities, according to the data updated at 8 am.",
  "Corporate earnings major factor to watch out for; markets may face volatility this week: Analysts": "Markets will also track global equities for further direction, they added. Santosh Meena, head (research) at Swastika Investmart, said, \"If we talk about the cues for this week then the next batch of earnings season and the October month F&O (futures and options) expiry may cause volatility in the market.”",
  "Covid LIVE: Tamil Nadu govt eases restrictions on schools, cinemas": "Latest news LIVE updates: PM Modi will interact with beneficiaries and stakeholders of the \"Aatmanirbhar Bharat Swayampurna Goa programme today. Stay tuned for the latest news of the day.",
  "Cricket-India-Pakistan blockbuster set to light up Twenty20 World Cup": "India captain Virat Kohli and Pakistan counterpart Babar Azam have called it just another game, but that is clearly not the case.",
  "Cricketer, filmmaker join Indian celebs launching NFTs amid global craze": "Indian celebrities from the world of Bollywood and cricket are increasingly launching digital memorabilia",
  "Crypto Challenge by CoinSwitch Kuber | Ep. 3": "",
  "Cryptocurrency Prices Today on October 24: Bitcoin slightly falls, Ethereum surges over 2%": "Bitcoin's price is currently Rs 47,35,999  and its dominance is currently 45.06 percent, an decrease of 0.45 percent over the day.",
  "DFC to finance $50 million to Biological E to expand COVID-19 vaccine manufacturing capacity": "The agreement will help bolster near-term COVID-19 response efforts and will also benefit long-term global health in India and throughout the Indo-Pacific region.",
  "DU's special cut-off list to release on October 25: Check details": "October 22 was the last day for the colleges to approve the applications. The payment gateway closed at 5 pm on October 23.",
  "Daily Voice | Gaurav Garg of CapitalVia expects gap up opening in RIL, ICICI Bank, Yes Bank on October 25": "Gaurav Garg of CapitalVia believes there is enough steam left in sectors especially in PSU stocks as they are still worth investing due to lower PE (price-to-earnings) and attractive dividend yield.",
  "Dalal Street Week Ahead | 10 key factors that will keep traders busy next week": "After exceeding the 40,000 mark for the first time this week, Bank Nifty is likely to be in the limelight in the next week as various banks will announce their results, says Yesha Shah of Samco Securities.",
  "Data | Where does India stand on the global hunger index?": "\n                Results of NFHS-5 (2019-20) showed that in the majority of the States for which data were released, child stunting and child wasting increased compared to 2015-16\n            ",
  "Deadline For Filing GST Returns Is Tomorrow. Key Dates To Note": "The Central Board of Indirect Taxes and Customs (CBIC) said the due date to file the quarterly GSTR-3B return for July to September, is October 24.",
  "Deal on Joe Biden's $2 trillion plan edges closer; Kamala Harris is 'confident'": "Negotiations were expected to continue into the weekend, all sides indicating just a few issues remained unsettled in the sweeping package of social services and climate change strategies.",
  "Deduction for interest paid on money borrowed from friends and relatives": "As per the latest provisions of the law, you are not allowed to attach any document with your returns of income in respect of any of your claim for deductions or exemptions including for the interest claim",
  "Delhi's air quality in 'moderate' category; negligible impact of stubble burning": "According to the Ministry of Earth Sciences' forecast body SAFAR, Delhi's air quality index (AQI) was recorded at 173 and is likely to remain in the moderate category for the next three days.",
  "Delta AY.4.2 mutation now Variant Under Investigation in UK due to high growth rate": "AY.4.2, dubbed \"Delta Plus\" and now named VUI-21OCT-01 by the UK Health Security Agency (UKHSA), has been under closer scrutiny in recent days after evidence indicated that it spread more quickly than the dominant Delta variant.",
  "Dish TV Rs 10 bn rights issue critical for survival: Company executive": "The rights issue is critical for the survival of the DTH company, its top official said",
  "EPFO: 4 ways to check PF balance online. Details here": "EPFO members can check their PF balance online in four ways — by logging in at Umang App, using EPFO portal, by sending SMS to 7738299899 or by giving a missed call 011-22901406",
  "ETMarkets Investors' Guide: Are FMCG stocks losing their flavour?": "",
  "Earthquake of magnitude 6.2 strikes Taiwan: EMSC": "It had a depth of 66.8 km (41.5 miles), and could be felt across the northern and eastern parts of Taiwan, with the epicentre in Yilan county, the weather bureau added.",
  "Entire world looking up to India in view of its vax drive success: PM Modi": "Modi lauded vaccine manufacturers for playing a \"big role\" in the success story of the country",
  "Ethereum: The transformation that could see it overtake bitcoin": "Ether is currently worth in aggregate just shy of US$500 billion (363 billion).",
  "Explainer - Income tax rules for NRIs who invest in stocks, mutual funds in India": "The dividend income as well as the capital gains earned by your son from shares listed in India and equity oriented schemes of mutual funds are subject to tax in India",
  "FTA with UAE likely by March, says negotiator ": "\n                Good progress made in talks: Reddy\n            ",
  "Fit to Lead | HRX's Pallavi Barman: \"Stiffness is not good when it comes to fitness or leadership\"": "HRX brand custodian Pallavi Barman on why she does parkour, running, cycling, yoga, bodyweight exercises, HIIT and strength training, and how fitness and leadership intersect in her life.",
  "Forex Reserves Rise By $1.492 Billion To Touch $641 Billion": "Forex Reserves Data: In the previous week ended October 8, the reserves had increased by $2.039 billion to $639.516 billion",
  "G-20 summit: PM Modi expected to call for united approach to deal with Afghan crisis": "The G-20 heads of state and government Summit will be held in Rome on October 30 and 31, with the participation of the leaders of the grouping and representatives of some of the main international and regional organizations.",
  "Gaia onboards digital platforms MagicPin, CRED, Mojobox and Smytten": "Under these partnerships, Indian wellness brand Gaia aims to enhance awareness in the digital space and increase its customer base.",
  "Gold Bonds Scheme's 7th Tranche Opens On Monday: Check Issue Price": "Sovereign Gold Bond 2021-22 Scheme: According to the RBI, an issue price of Rs 4,765 per unit, equivalent to the value of one gram of gold, is applicable for the seventh installment",
  "Government likely to introduce 2 key financial sector bills in parliament winter session": "\n                The government is also likely to table amendments to the Pension Fund Regulatory and Development Authority (PFRDA) Act, 2013, to enable separation of the National Pension System Trust (NPS) from the PFRDA for ensuring universal pension coverage\n            ",
  "Govt Kick-Starts Process for Self-Reliance in Green Energy; Global Bids Invited for Setting Up New Units": "ACCs are new generation technologies that can store electric energy either as electrochemical or as chemical energy and convert it back to electric energy as and when required.",
  "Govt. may raise over ₹10,000 crore via Bharat Bond ETF by December": "\n                Bharat Bond ETF is an exchange-traded fund that invests in debt of public sector companies.\n            ",
  "Gujarat: First IVF calf of Banni buffalo breed born in Gir Somnath": "Banni buffalo is known for its resilience and higher milk producing capacity in an arid environment.",
  "Gujarat: Over 2,000 people get COVID-19 vaccine at home in Ahmedabad": "Under its mega COVID-19 vaccination drive, the Ahmedabad Municipal Corporation (AMC) on October 7 launched this special facility for those above the age of 50 years and differently-abled people aged 18 and above.",
  "Haryana to provide smartwatches to officials to track attendance": "The smartwatch will send the real-time location of the employees to the central control room and their attendance will then be marked.",
  "Healing Space | The secret to a 50-50 in relationships": "You’ve shaken hands and you’ve laid out the terms of engagement. But what really makes for equality in any partnership?",
  "Here are some of the new cryptocurrencies added in the market recently": "There are over 6000 cryptocurrencies as of 2021 and new coins keep appearing. It is gaining worldwide acceptance. Cryptocurrency is a digital currency used to buy goods and services and work as a medium of exchange. CoinMarketCap has listed out the recent addition of cryptocurrencies in the market. Take a look…",
  "How DAOs unlock value for investors securely through multi-chain integration": "Made possible due to the power of the blockchain, DAOs are a natural evolution of DeFi applications and have revolutionized governance through community-led voting mechanisms, involving holders of its native tokens. This self-governance model makes these DAOs truly autonomous and grants its native token holders full rights over the decision-making process in addition to a commensurate share of distributing fees, further enhancing the overall proposition for new investors to join these networks.",
  "How Facebook's algorithm led a test user in India to fake news, gore": "Photos of beheadings and jingoistic scenes of violence fill hypothetical account's feed days after it set up in Feb 2019 to see the content Facebook recommends users.",
  "How to get same day's NAV in mutual funds": "If you want to invest in the last half an hour before the cut-off time of 3 pm, then you may try to invest through websites of the AMCs directly, this may help you get the allotment based on that day’s NAV",
  "How to invest in mutual funds": "You can use online SIP calculators to find out the monthly contributions required to achieve those short-term financial goals, assuming an annualized return of 5% per annum",
  "I have sold a plot. Can I file income tax return inder ITR 1?": "Even if you owned a residential house jointly with others the same has to be treated as ownership of one house for the purpose of section 54F",
  "ICC T20 World Cup 2021 | Australia survive a scare to beat South Africa": "Both sides struggled with their batting, but Australia managed to get over the line in the last over.",
  "ICICI Bank Net Profit Rises 30% To Rs 5,511 Crore In September Quarter": "ICICI Bank Q2 FY22 Results: ICICI Bank reported a 29.6 per cent rise in net profit to Rs 5,511 crore on a standalone basis for the July-September quarter in the financial year 2021-22, compared to Rs...",
  "ICICI Bank Q2 Result | Profit grows 30% to Rs 5,511 crore, NII rises 25% to Rs 11,690 crore": "ICICI Bank has given significant return in the current financial year FY22, rising more than 30 percent, outperforming Nifty Bank index by a strong margin which gained 21 percent in the same period.",
  "ICICI Bank Q2 Review: The New 'Best In Class'?": " ICICI Bank reported its highest ever quarterly profit driven by strong core operating performance.",
  "ICICI Bank Q2 net climbs 30%, Net Interest Income rises": "\n                Net interest income jumps 25% helping lift profit to ₹5,511 crore; bad loans decline sequentially\n            ",
  "ICICI Bank Q2 results takeaways: Profit, NII beat Street estimates; asset quality improves": "ICICI Bank's September quarter numbers beat Street estimates on all key metrics. Asset quality for the bank improved and fresh provisions also fell. Net interest margin (NIM) improved to 4 per cent while disbursements of personal loans and auto loans were close to March quarter levels. Besides, SME loans soared 44 per cent on a YoY basis.",
  "ICICI Bank Q2 results: Net profit rises 30% to Rs 5,511 crore": "​Non-interest income growth also was healthy led by fees from retail, business banking and SME customers. Fee income grew by 21% year-on-year to Rs 3,811 crore from Rs 3,139 crore (US$ 423 million) a year ago. ​Treasury income fell to Rs 397 crore from Rs 542 crore a year earlier and included a gain of Rs 305 crore from sale of shares of ICICI Securities.",
  "ICICI Bank UK repatriates $200 million capital to parent firm in India": "This is not the first time the bank has repatriated capital from its foreign arms",
  "ICICI Bank reports highest ever quarterly net profit of Rs 5,511 cr in Q2": "Asset quality of the lender improves; net interest margin rises to 4%",
  "ICICI Bank says restructured Rs 3,029.94 crore worth personal loans in Q2; total recast at Rs 4,158 crore": "The bank's net NPA were at 0.99 percent which are lowest ever reported in the last six years. Sandeep Batra, Executive Director at ICICI Bank said they will focus on growing in all segments and grow in a risk calibrated fashion.",
  "ICRA MD & CEO N Sivaraman resigns": "Ramnath Krishnan has been appointed as new MD",
  "IRB InvIT Q2 results: Revenue rises to Rs 328 cr": "IRB InvIT, India's first listed infrastructure investment trust, on Saturday said its revenue in September quarter 2021 increased to Rs 328 crore. It had clocked a revenue of Rs 296 crore in the year-ago period, it said in a statement.",
  "IT more widely sought now globally: WNS CEO": "\n                Digital push bolstering BPM prospects\n            ",
  "Icra appoints Ramnath Krishnan as Managing Director and Group CEO": "Ramnath Krishnan, who will assume the new charge with immediate effect, has a proven record of leadership, gained during the course of a career spanning more than three decades in banking and finance in India and abroad, Icra said in a statement.",
  "If Covid vanished, Pansari Group's Shammi Agarwal would like to meet Ratan Tata": "Shammi Agarwal, MD, Pansari Group, on his dream guest and the different things he’d like to experience in life after Covid.",
  "India Inc earnings, US data, Fed taper talk to drive earnings this week": "Profit booking in blue-chip stocks after a recent rally also weighed down benchmark indices with the BSE Sensex slipping 0.79 per cent to 60.821.62 during the week. The BSE midcap index lost 4.24 per cent to settle at 25,566.64 while the smallcap index shed 5.21 per cent to close at 28,336.31 per cent.",
  "India high cost environment for airlines; critical that AERA is empowered further: IATA official": "AERA decides what tariffs -- such as base airport charges, landing charges, parking charges and passenger service fee -- can major Indian airports charge an airline or a passenger for a particular period after considering the airports' expenditure and revenue projections for that period.",
  "India high cost environment for airlines; critical to empower AERA: IATA": "Since the beginning of the pandemic in February last year, AERA has rejected the demands of operators of major airports such as Delhi and Mumbai for a major increase in tariffs for third control period, which began on April 2019 and ends on March 2024. For example, AERA had in December 2020 rejected the Delhi airport operator DIAL's demand to increase base airport charges by 424 per cent.",
  "India needs to address consequences of instability in neighbourhood: Gen Bipin Rawat": "General Bipin Rawat also said there is a possibility of threat to Jammu and Kashmir as well as to the North-eastern region due to the situation in Afghanistan which the Taliban has taken over a few months ago but the threat can be negated by working on internal monitoring.",
  "India to bargain for undelivered cargoes for renewing LNG import contract with Qatar": "Petronet LNG Ltd’s 7.5 million tonnes a year liquefied natural gas (LNG) import deal with Qatargas is ending in 2028. Renewal, if any, has to be confirmed 5 years ahead of that.",
  "India's Digital Tax Will Be Withdrawn Once Global Reform Effective: Finance Minister Sitharaman": " Finance Minister Nirmala Sitharaman on the global tax reform agreement and India's position.",
  "India's electronic manufacturing industry to touch $250-300 billion by 2024-25: Rajeev Chandrasekhar": "\n                ‘This is Y2K moment for digital economy and its stakeholders’\n            ",
  "India, UK democracies; can make world safer, prosperous: UK minister Truss": "UK Foreign Minister Elizabeth Truss on Saturday said her country and India believed in freedom and democracy",
  "India-Bangladesh ties deeper than any other strategic partnership: Harsh Vardhan Shringla": "Having served in Bangladesh, Shringla said he has heard many brave accounts of the dogfights that IAF pilots engaged in over Dhaka, which greatly inspired the Bangladeshi people watching this from their rooftops.",
  "Industry demands leather park scheme to boost growth": "CLE Chairman Sanjay Leekha also said that the benefits of the Production Linked Incentive Scheme (PLI) should also be extended to the leather sector.",
  "Internal Alarm, Public Shrugs: Facebook’s Employees Dissect Its Election Role": "Facebook has publicly blamed the proliferation of election falsehoods on former President Donald Trump and other social platforms. But the company documents show the degree to which Facebook knew of extremist movements and groups on its site that were trying to polarize American voters before the election.",
  "Interview | We are talking to Indian vaccine makers about their production and supply, says WTO DG": "\"We are working on a pragmatic solution out of the deadlock on patent waiver negotiations. Formal negotiations on patent waiver struck at TRIPS council,\" said Ngozi Okonjo-Iweala, WTO Director-General.",
  "Is there really any limit upto which one can own gold?": "Gold jewellery can be either self-acquired or you might have received the same through gifts or inheritance",
  "Is this the era of the retail investor?": "The result is that the Indian stock market is now dominated by retail investors. The NSE alone saw retail investors share grow from 33% in 2016 to 45% in 2021. The interest isn’t abating either, with monthly registration of new investors increasing to an all-time high of 1.5 million in June 2021.",
  "JSW Steel plans to levy surcharge on steel products as input cost mounts": "To offset the rising input cost, the domestic steel giant JSW Steel is planning to levy a surcharge",
  "John Neff on the merits of betting on low P/E investing": "The most important prerequisites for investment success are judgement and fortitude, according to legendary investor John B. Neff, and investors do not require the help of glamour stocks or bull markets to attain their investment goals.",
  "Karwa Chauth 2021: Stunning photos of Bollywood celebrities": "A festival that brings husband and wife together, on Karwa Chauth married women begin fasting before sunrise that lasts until moonrise for their husband's long life.",
  "Kashmir snowfall: Two killed in Anantnag, death toll climbs to 5": "The rescue team of civil, police army and State Disaster Response Force (SDRF) officials traversed 30 km through snow-covered and foggy terrain, aided by machinery and walked for 8 km to reach the location, the officials said.",
  "Kashmir: Apple orchards suffer extensive damage as snowfall, rains hit life": "Parts of Kashmir received snowfall and plains were lashed by heavy rains on Saturday",
  "Keventers on expansion drive; targets system turnover of Rs 700 crore by 2025-26": "The vintage brand was revived in 2015 by three individuals Agastya Dalmia, Aman Arora and Sohrab Sitaram, having undergone changes in ownership in its history since it was founded in 1925 by Edward Keventer.",
  "Kohli the batsman is daunting, but what about his legacy as captain?": "If India fail to win the ongoing T20 World Cup, Kohli will have gone down in history as the 'almost winner'",
  "Live news: Modi credits health workers for one bn Covid vaccine milestone": "Live news: ICICI Bank says net income rose about 30 per cent in the second quarter, Saudi Arabia announces net zero target.",
  "Lottery Sambad Result October 24: 'Dear Bangasree Ichamati’ lottery winners to be announced at 4 pm": "Lottery Sambad Result: The winner of the first prize will take home Rs 50 lakh. The second prize is Rs 9,000, the third prize is Rs 500 and the fourth prize is Rs 250. While the fifth prize is Rs 120, the consolation prize is Rs 1,000.",
  "MC Interview | 10-15% correction if Nifty closes below 17,900: Mazhar Mohammad of Chartviewindia": "Medium to long term trend of Nifty is still favouring bulls as momentum backed by liquidity is very high and clearly positively biased in favour of bulls.",
  "Mandar Jamsandekar's 2 stock picks for this week": "In the last 10 months RVNL was trading range bound between levels of Rs 26 which was the support and Rs 35 which was the resistance. Now this week the stock has managed to break past this resistance and this tells us that a fresh move is now going to start. Traders can buy this stock with a stop loss at Rs 36 for an upside target of Rs 52.",
  "Matchboxes to get costlier, price to increase after 14 years": "The last hike in prices was in the year 2007 when the rate of a single box was increased from 50 paise to Rs 1. Prior to that, in 1995, the cost of matchbox was increased from 25 paise to 50 paise.",
  "Mcap of 5 of 10 most valued firms down by Rs 1.42 trn; HUL and RIL most hit": "The combined market valuation of five of the top-10 most valued companies eroded by Rs 1,42,880.11 crore",
  "Melbourne to ease more COVID curbs as 80% vaccination rate nears": "Home to about five million people, Melbourne endured 262 days, or nearly nine months, of stay-at-home restrictions during six lockdowns since March 2020, longer than the 234-day continuous lockdown in Buenos Aires.",
  "Minda Industries to hike stake in Strongsun Renewables to 28.10%": "Minda Industries on Saturday said the investment committee of its board has given its go-ahead to second tranche of stake purchase in Strongsun Renewables Pvt Ltd. The committee approved the acquisition of 3,07,850 equity shares of the face value of Rs 10 each at a premium of Rs 70 i.e. Rs 80 per share of Strongsun Renewables Private Ltd, aggregating to Rs 2,46,28,000, according to a BSE filing.",
  "Modi govt trying to confuse people with campaign on COVID inoculation figures: Adhir Chowdhury": "The leader of the Congress in Lok Sabha claimed that Modi’s campaign on administration of 100 crore vaccine doses was projected in a way that made it look like 100 crore people have been inoculated.",
  "Multi-year earnings recovery cycle to help market move up further: Siddhartha Khemka": "“We are just at the start of a good economic growth phase and that should lead to a multiyear earnings recovery cycle which we have not seen for almost a decade now. It should help the markets to continue to move up. ”",
  "Myntra CEO Amar Nagaram steps down": "According to an email by Flipkart CEO Kalyan Krishnamurthy to employees, Nagaram will be at Myntra till December-end to ensure a smooth transition, and will continue to be associated in an advisory role.",
  "NASA now targeting February 2022 for its Artemis I mission": "The Artemis program will see the first woman and first person of color step foot on the lunar surface. NASA will also deploy small satellites, known as CubeSats, to perform experiments and technology demonstrations.",
  "NEP came at a time when disruptive technology has made solid routes in many sectors: Dharmendra Pradhan": "Pradhan also emphasised that the benefits of digital infrastructure can be fully utilised when each and every student has access to digital devices.",
  "NFT Collector Group Buys Rap Group's Wu-Tang Clan Album For $4 Million": "A non-fungible token (NFT) is a digital object -- a drawing, animation, piece of music, photo, or video -- with a certificate of authenticity created by blockchain technology.",
  "Nandita Das: “Feminism has no gender; anyone can be a feminist”": "Actor-director Nandita Das believes the roots of gender discrimination lie in childhood, and feminism needs to focus on boys and men.",
  "Nawab Malik may have got concrete evidence against Sameer Wankhede, hence speaking against him: NCP minister": "Over the last few days, Malik has been criticising Wankhede, who had supervised a raid on a cruise liner off the Mumbai coast earlier this month that led to the alleged recovery of drugs and arrest of superstar Shah Rukh Khan’s son Aryan.",
  "New IPL teams: BCCI expecting anything between Rs7,000 crore-10,000 crore with Adani, Goenka, Aurobindo in fray": "There are 22 companies which have picked up tender document worth Rs 10 lakh but with base price for new teams pegged at INR 2000 crore, there is expected to be only five to six serious bidders in fray.",
  "Nigeria to launch digital currency on Monday to enhance payments": "The eNaira, which took several years to develop, will “make financial transactions easier and seamless for every strata of the society,” the Central Bank of Nigeria said in emailed statement on Saturday. The digital currency will complement the physical naira.",
  "Oil Ends Week Below Record Highs. Brent Crude Registers 7th Weekly Gain": "Brent crude futures rose 92 cents, or 1.1 per cent, to settle at $85.53 a barrel. The benchmark, which touched a three-year high of $86.10 on Thursday, was up one per cent in the week, its seventh...",
  "P2P lending machine fire on all cylinders as bank loan disbursals falter": "The bulk of the lenders filling up the rosters of prominent P2P platforms are return-hungry retail investors and traders with surplus cash flows. Low fixed-income returns prompting these high net worth individuals and family offices are writing large cheques favouring borrowers on these platforms.",
  "PM Modi interacts with Indian manufacturers of Covid-19 vaccine": "CEOs say Modi's leadership has been the key force in India's vaccination drive",
  "PM Modi meets Indian COVID vaccine manufacturers; CEOs say his leadership key force in vaccination drive": "Representatives from seven vaccine makers -- Serum Institute of India, Bharat Biotech, Dr Reddy's Laboratories, Zydus Cadila, Biological E, Gennova Biopharma and Panacea Biotech -- participated in the meeting.",
  "Pakistan rejects reports of agreement with US to conduct air operations in Afghanistan": "The Foreign Office (FO) issued a statement in response to media queries regarding the news report alluding to formalisation of an agreement between the two countries to conduct military and intelligence operations against Afghanistan.",
  "Panasonic hopeful of robust festive sales, to invest Rs 300 crore under PLI scheme": "The company was also planning to invest Rs 300 crore to manufacture compressors and heat exchangers under the country’s production linked investment (PLI) scheme.",
  "Petrol price up Rs 36 a litre, diesel 26.58 in less than 18 months": "Petrol in Delhi now costs Rs 107.24 a litre and diesel comes for Rs 95.97, according to a price notification of state-owned fuel retailers.",
  "Petrol, Diesel Prices Hiked On Sunday: Diesel Nearing Rs 100-Mark In Kolkata": "Petrol and Diesel Price Today: Fuel prices were further hiked on Sunday, October 24, for the fifth consecutive day",
  "Petrol, diesel prices hiked for 5th straight day; Diesel above ₹100 in West Bengal": "\n                Diesel rates have been increased by ₹7.70 per litre in 24 hikes since September 24.\n            ",
  "PhonePe withdraws petition against BharatPe's Postpe, to file fresh suit": "During the hearing, the Court observed that the mark PostPe adopted by Resilient Innovations is so phonetically, structurally and visually similar to PhonePe mark that it also thought that PostPe/postpe is a natural evolution of the word PhonePe and emanated from PhonePe.",
  "Power ministry comes out with rules to ensure sustainability of sector": "\n                A formula has been provided to calculate adjustment in the monthly tariff due to the impact of change in law.\n            ",
  "Prioritisation of domestic coal to power sector hit Hindustan Zinc: CEO": "The prioritisation of domestic coal supply to the power sector has to \"some extent\" hit Hindustan Zinc, a top official of the Vedanta group firm said",
  "Private Oil Refiners To Work With State-Run Peers For Cheaper Oil Imports": "India is the world's third-largest oil importer and consumer, reliant on imports for about 85 per cent of its crude and buying most of that from Middle East producers.",
  "Priyanka Gandhi Vadra flags off 'Pratigya Yatras' from UP's Barabanki": "The yatras will take three different routes–Barabanki to Bundelkhand, Saharanpur to Mathura and Varanasi to Rae Barelifrom October 23 to November 1 with the slogan, \"Hum Vachan Nibhayenge”.",
  "Providing best education to children is greatest act of patriotism: Arvind Kejriwal": "Paying tributes to Maharshi Valmiki at an event hosted by Delhi Sanskrit Academy at Thyagaraj Stadium, Kejriwal said government schools are much better now and 2.5 lakh students from private schools moved there this year.",
  "Punjab must come back to 'real issues' that concern every Punjabi: Navjot Singh Sidhu": "Navjot Sidhu's assertion comes amid the ongoing war of words between several Congress leaders from Punjab with former chief minister Amarinder Singh over the latter's friendship with Pakistani journalist Aroosa Alam.",
  "Razorpay launches 'TokenHQ' card in partnership with Mastercard, RuPay and Visa": "Razorpay TokenHQ is aimed at helping end-customers to continue experiencing the convenience of saved card transactions. This is a multi-network Card-on-File (CoF) Tokenisation solution which works across all major card networks including Mastercard, RuPay, and Visa.",
  "Rent of retail space up 11-17% in Delhi's upscale markets in July-September": "The Delhi-NCR market recorded improved retail activity during the September quarter, the consultant said, adding that early signs of recovery could be seen with a pick-up in retail leasing.",
  "SBI mega e-auction for properties on October 25: Check details": "SBI mega e-auction for properties: Bidders can bid for some home, plot or shop at a price lower than the existing market rate under SBI mega e-auction.",
  "SJS looks for acquisitions in North America, Europe and Asian markets": "The deal size could be around Rs 100-150 crore and the potential acquisition could bring in incremental revenues of Rs 200-300 crore and many international markets access. The acquisition is likely to be funded from the internal accruals and debt, if need arises, added people.",
  "Saudi Aramco sets 2050 zero carbon emissions target": "Saudi Arabia, the world's top crude exporter, said it would also join a global effort to cut methane emissions by 30 percent by 2030.",
  "Shah Rukh Khan, Aryan Khan and the war on Bollywood": "One of India’s biggest mass cultural barometers is under attack, and being safe and politically correct aren’t going to save its autonomy.",
  "Singapore removes India, 5 other South Asian nations from travel restriction list": "All travellers with a 14-day travel history to Bangladesh, India, Myanmar, Nepal, Pakistan and Sri Lanka will be allowed to enter or transit through Singapore from Wednesday.",
  "Sovereign Gold Bond Series VII opens on October 25, here's all details": "The SGB will be open for subscription for 5 days from 25 to October 29, 2021 and the certificate of bond(s) will be issued on November 02, 2021. The government has fixed the price at Rs 4,765 per gram of gold.",
  "Sri Lanka seeks $500-million loan from India for fuel purchases amid forex crisis": "The proposal has been sent to the Treasury for approval and would be submitted to the Cabinet thereafter,” said Energy Minister Udaya Gammanpila.",
  "Storyboard | Star Sports' Mauka Mauka is back, to tap into Ind vs Pak cricket frenzy": "The cheeky humour in Star Sports' 'Mauka Mauka' campaign has resonated with fans online, with the latest ad garnering over 1.7 million YouTube views.",
  "T20 WC AUS vs SA LIVE SCORE: Stoinis' cameo helps Australia win by 5 wkts": "Aiden Markram scored 40 runs for the Proteas after their top-order crumbled. Australia needs 119 runs to win. Check Australia vs South Africa Live score and match updates here",
  "T20 WC, ENG vs WI Highlights: Eng posts an easy victory, win by 6 wickets": "Put to bat first, West Indies were all out for 55 runs in just 14.2 overs against England",
  "T20 WC, ENG vs WI LIVE SCORE: West Indies all out for 55 runs": "ICC T20 World Cup 2021: England vs West Indies in the second match of the Super 12 stage at the Dubai International Stadium",
  "T20 World Cup 2021 | India vs Pakistan: Old foes meet at usual place": "Although the odds are in favour of India, Pakistan are quite capable of causing an upset.",
  "T20 World Cup | India vs Pakistan history in world cup matches": "India and Pakistan are just few hours away from the much awaited T20 World Cup match, which is scheduled to take place on October 24 at the Dubai International Cricket Stadium. The rivalry on the pitch between the two cricket crazy neighbours is well known. Let’s take a look at all the past T20 World Cup encounters between the two teams.",
  "Tamil Nadu allows 100 per cent occupancy in theatres; Classes for 1-8 on rotational basis from November 1": "The decision on easing curbs further with immediate effect was taken at a review meeting presided over by Chief Minister M K Stalin.",
  "Tamil Nadu extends lockdown restrictions with some relaxations till Nov 15": "The state government passed the order on Saturday",
  "Tata Power, IIT-Delhi to collaborate in clean energy space": "\n                Tata Power and IIT-Delhi have signed an MoU to collaborate in areas such as smart grid technology, clean energy solutions, a company statement said.\n            ",
  "Tayyip Erdogan says Turkey is set to banish 10 Western ambassadors": "Kavala has been in prison for four years, charged with financing nationwide protests in 2013 and with involvement in a failed coup in 2016. He denies the charges.",
  "Terrorists adopting new tactics because government's success in J&K has baffled them: Ram Madhav": "As many as 11 civilians have been killed in the Valley in October, some of them belonging to minority communities. Madhav’s comments came against the backdrop of a spurt in violence in the Kashmir Valley.",
  "The Tippling Point | A snapshot of schnapps": "How is German schnapps different from British and American schnapps, and what are the world's favourite five schnapps?",
  "The unending agony of the Indian football fan": "India is a lowly 106 on FIFA’s ranking of countries. At a time when sports in India has been going through a purple patch, football has been the one sore spot.",
  "The violence in 'Squid Game' and 'My Name' is intense but never gratuitous": "'Squid Game' is still the No. 1 show on Netflix in India more than a month after it dropped, and 'My Name' is at No. 6.",
  "Thinkpad: Numbers Talk": " Earnings are rolling in and there's a theme building — inflation.",
  "Three security men, Pakistani terrorist injured in fresh firing by militants in J&K's Poonch": "Heavy firing and explosions were reported from Bhatta Durrian forest of Mendhar which along with nearby forest areas adjoining Surankote (Poonch) and Thanamandi in Rajouri district is witnessing a massive search operation, the officials said.",
  "To address the mental health challenges of children and women, schools must reopen: Vikram Patel": "The Harvard University professor is one of the best-known psychiatrists and researchers, renowned for his work on child development and mental disability in low-resource settings.",
  "Top cryptocurrency news on October 24: Major stories on Walmart, new cryptocurrencies and more": "A daily round-up of the most interesting articles on cryptocurrencies like Bitcoin, Ethereum and Tether to help jump-start the day.",
  "Top oil exporter Saudi Arabia targets net zero emissions by 2060": "Crown Prince Mohammed bin Salman and his energy minister said OPEC member Saudi Arabia would tackle climate change while ensuring oil market stability, stressing the continued importance of hydrocarbons.",
  "Trump’s tech SPAC could make him billions with meme-stock frenzy": "News that the former president’s nascent media enterprise, Trump Media & Technology Group, is planning to go public via a special purpose acquisition company has sent retail investors into a frenzy. The stock gain drove the implied value of the new venture to more than $8.2 billion.  Based on figures from press releases and filings to the SEC it appears Trump will own more than 50% of the combined company. At its current value, that would make him the richest he’s ever been.",
  "Turkish President orders removal of 10 ambassadors, including US envoy": "Recep Tayyip Erdogan said that he had ordered the ambassadors to be declared persona non grata",
  "US sabotaging China-Pakistan Economic Corridor: Imran Khan's aide": "Chief of the CPEC Authority has accused the United States of sabotaging the multi-billion dollar project",
  "Vaccination drive's success shows India's potential: Modi on 'Mann Ki Baat'": "Prime Minister Narendra Modi on Sunday lauded India's landmark achievement of 100 crore Covid-19 vaccinations",
  "We should prepare for end of bull market but at this stage I am not calling it out: Maneesh Dangi": "“My bet is in India the bull market would be longish and the midcycle phase would persist for one-two years at least, if not more. There will be lowish but reasonable returns in Nifty. We will have volatile returns in small and midcaps.”",
  "What is value investing? Amit Premchandani of UTI AMC explains": "A reason why a cheap multiple driven approach to 'Value\" is not working is that, in fact, cheap valuation could be misleading.",
  "Why India should ignore global rankings, including the ones where it fares well": "Problems with global indices like Doing Business and the Global Hunger Index where India didn't even place in the top 100 countries boil down to methodology and relevance.",
  "‘Cybersecurity will remain a top priority for firms this year’": "\n                 ‘In digital world, security must be built-in, not bolted on’\n            "
}